---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationServiceButton Properties
FabricationServiceButton Class See Also Send Feedback
---

The FabricationServiceButton type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | ButtonIndex | The button index for this button. |
|  | Code | The code of the button. |
|  | ConditionCount | The number of conditions. |
|  | IsAHanger | Checks if the fabrication service button is hanger. |
|  | IsStraight | Checks if all of the fabrication service button conditions are straights. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the button. |
|  | PaletteIndex | The palette index for this button. |
|  | ServiceId | The fabrication service identifier for the fabrication service this button belongs to. |

# See Also

FabricationServiceButton Class

Autodesk.Revit.DB Namespace